{"keras_version": "2.0.1", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_5", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 66, 200, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_1", "class_name": "Lambda", "config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa8C:/Work/repos/CarND-Behavioral-Cloning-P3/clone_combo.py\u00da\b<lambda>\u0012\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1"}}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "padding": "valid", "use_bias": true, "name": "conv2d_1", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "activation": "elu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 24, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "padding": "valid", "use_bias": true, "name": "conv2d_2", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "activation": "elu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 36, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "padding": "valid", "use_bias": true, "name": "conv2d_3", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "activation": "elu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 48, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [8, 8], "padding": "same", "use_bias": true, "name": "conv2d_6", "strides": [4, 4], "kernel_constraint": null, "kernel_regularizer": null, "activation": "elu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 16, "activity_regularizer": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "padding": "valid", "use_bias": true, "name": "conv2d_4", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "activation": "elu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "padding": "same", "use_bias": true, "name": "conv2d_7", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "activation": "elu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "padding": "valid", "use_bias": true, "name": "conv2d_5", "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "activation": "elu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "padding": "same", "use_bias": true, "name": "conv2d_8", "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "activation": "elu", "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "flatten_2", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "elu"}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_4"}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "elu"}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_3", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 50, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "elu"}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_4", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "elu"}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_5", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "elu"}}]}, "class_name": "Model", "backend": "tensorflow"}