{"config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 66, 200, 3], "name": "input_1", "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa8C:/Work/repos/CarND-Behavioral-Cloning-P3/clone_combo.py\u00da\b<lambda>\t\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "trainable": true, "output_shape": null}, "name": "lambda_1", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "conv2d_1", "padding": "valid", "strides": [2, 2], "filters": 24, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "conv2d_2", "padding": "valid", "strides": [2, 2], "filters": 36, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "conv2d_3", "padding": "valid", "strides": [2, 2], "filters": 48, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [8, 8], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "conv2d_6", "padding": "same", "strides": [4, 4], "filters": 16, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "conv2d_4", "padding": "valid", "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "conv2d_7", "padding": "same", "strides": [2, 2], "filters": 32, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "conv2d_5", "padding": "valid", "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "conv2d_8", "padding": "same", "strides": [2, 2], "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"rate": 0.5, "name": "dropout_2", "trainable": true}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"rate": 0.5, "name": "dropout_3", "trainable": true}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"name": "flatten_2", "trainable": true}, "name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 512, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"rate": 0.5, "name": "dropout_4", "trainable": true}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 100, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "dense_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 50, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "dense_3", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 10, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "dense_4", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "elu", "name": "dense_5", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "output_layers": [["dense_5", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.1", "backend": "tensorflow"}